### 1. Mean

### 2. Median

### 3. Mode

In [10]:
import pandas as pd

#  Median getting directly without import math

#  Mean getting ---> import math

-------------------------------------------------------------------------------------------------------------------------------

### 1. Mean

In [6]:
df1 = pd.read_csv('C:/Users/deepusuresh/Documents/Data Science/10. Missing Values/2. Handling_missing_data_replace/hiring_stats.csv')
df1

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [11]:
import math

In [13]:
mean = math.floor(df1['test_score(out of 10)'].mean())
mean

7

In [14]:
df1['test_score(out of 10)'] = df1['test_score(out of 10)'].fillna(mean)
df1

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

-------------------------------------------------------------------------------------------------------------------------------

### 2. Median

In [3]:
url = 'C:/Users/deepusuresh/Documents/Data Science/10. Missing Values/2. Handling_missing_data_replace'

df = pd.read_csv('homeprices.csv')
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

#### Data Preprocessing: Fill NA values with median value of a column

In [4]:
df.bedrooms.median()

4.0

In [5]:
df.bedrooms = df.bedrooms.fillna(df.bedrooms.median())
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

-------------------------------------------------------------------------------------------------------------------------------

### 3. Mode

In [25]:
df2 = pd.read_csv('C:/Users/deepusuresh/Documents/Data Science/10. Missing Values/2. Handling_missing_data_replace/homeprices.csv')
df2

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [26]:
df2.bedrooms.mode()

0    3.0
dtype: float64

In [29]:
df2.bedrooms = df2.bedrooms.fillna(df2.bedrooms.mode())
df2

AttributeError: 'Series' object has no attribute 'bedrooms'